


// alert( "отвечай на вопрос <yes> или <no>" );
//  var a = prompt ("у тебя есть котик?");
//  if (a == "yes") {
//    alert( "ты хороший человек" );
// }
// if (a == "no") {
//     alert( "тебе нужен котик" );
// } else {
//     alert("попробуй еще раз");
// }


// alert( "а теперь давай пройдем небольшой тест! Отвечай так же <yes> или <no>" );
// var b = prompt ("ты знаешь кто такой М.Манджукич?");
// var c = prompt ("тебе хотнлось бы в Загреб?");
// var d = prompt ("тебе известно что президент Хорватии женщина?");
// var f = prompt ("у тебя есть котик?");
// if (b, c, d == "yes") {
//   alert( "ты хороший человек! Чтоб узнать почему купи полную версию" );
// }
// if (b, c, d == "no") {
//   alert( "ты плохой человек! Чтоб узнать почему купи полную версию" );
// if(b, c, d =="no", f=="yes"){
//   alert( "но не огорчайся, у тебя есть котик")
// }
// if(b, c, d, f =="no") {
//   alert ("нет, не продам тебе полную версию, у тебя даже котика нет")
// }
// } 


// alert( " тест на археолога" );
// var a = prompt("сколько литров вина вы способны выпить за сутки?");
// if (a < 10) {
//     alert("вы еще не готовы")
// }
// if (a > 10) {
//     alert("за вами уже едут, готовтесь к собеседованию")
// }
var yes = 1; 
var no = 2;
alert("input yes or no"); 
var a = prompt("do you want to say hello?");
var b = prompt("do you want a good point?");
alert(a + b);


